; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l23_p23_c23_g23_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(at crate18 depot)
	(at crate19 depot)
	(at crate20 depot)
	(at crate21 depot)
	(at crate22 depot)
	(at crate23 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 food)
	(crate-content crate8 food)
	(crate-content crate9 food)
	(crate-content crate10 food)
	(crate-content crate11 food)
	(crate-content crate12 food)
	(crate-content crate13 food)
	(crate-content crate14 food)
	(crate-content crate15 food)
	(crate-content crate16 food)
	(crate-content crate17 food)
	(crate-content crate18 food)
	(crate-content crate19 food)
	(crate-content crate20 food)
	(crate-content crate21 food)
	(crate-content crate22 medicine)
	(crate-content crate23 medicine)
	(at person1 loc14)
	(at person2 loc20)
	(at person3 loc15)
	(at person4 loc19)
	(at person5 loc8)
	(at person6 loc18)
	(at person7 loc12)
	(at person8 loc4)
	(at person9 loc15)
	(at person10 loc14)
	(at person11 loc21)
	(at person12 loc1)
	(at person13 loc11)
	(at person14 loc19)
	(at person15 loc4)
	(at person16 loc2)
	(at person17 loc22)
	(at person18 loc5)
	(at person19 loc15)
	(at person20 loc8)
	(at person21 loc19)
	(at person22 loc5)
	(at person23 loc13)
	(person-needs person1 food)
	(person-needs person1 medicine)
	(person-needs person2 food)
	(person-needs person3 food)
	(person-needs person3 medicine)
	(person-needs person4 food)
	(person-needs person5 food)
	(person-needs person7 food)
	(person-needs person8 food)
	(person-needs person9 food)
	(person-needs person10 food)
	(person-needs person11 food)
	(person-needs person12 food)
	(person-needs person13 food)
	(person-needs person14 food)
	(person-needs person15 food)
	(person-needs person16 food)
	(person-needs person17 food)
	(person-needs person18 food)
	(person-needs person19 food)
	(person-needs person20 food)
	(person-needs person21 food)
	(person-needs person23 food)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 food)
	(person-has person1 medicine)
	(person-has person2 food)
	(person-has person3 food)
	(person-has person3 medicine)
	(person-has person4 food)
	(person-has person5 food)
	(person-has person7 food)
	(person-has person8 food)
	(person-has person9 food)
	(person-has person10 food)
	(person-has person11 food)
	(person-has person12 food)
	(person-has person13 food)
	(person-has person14 food)
	(person-has person15 food)
	(person-has person16 food)
	(person-has person17 food)
	(person-has person18 food)
	(person-has person19 food)
	(person-has person20 food)
	(person-has person21 food)
	(person-has person23 food)
	))
)

; plan
1. (grab-arm2 drone1 crate23 depot)
   deleted: (arm2-free drone1) (at crate23 depot)
   added: (arm2-load drone1 crate23)
   goals met: 1 of 24
2. (grab-arm1 drone1 crate22 depot)
   deleted: (arm1-free drone1) (at crate22 depot)
   added: (arm1-load drone1 crate22)
   goals met: 1 of 24
3. (move-drone drone1 depot loc15)
   deleted: (at drone1 depot)
   added: (at drone1 loc15)
   goals met: 0 of 24
4. (deliver-arm1 drone1 person3 crate22 medicine loc15)
   deleted: (arm1-load drone1 crate22) (person-needs person3 medicine)
   added: (arm1-free drone1) (person-has person3 medicine)
   goals met: 1 of 24
5. (move-drone drone1 loc15 depot)
   deleted: (at drone1 loc15)
   added: (at drone1 depot)
   goals met: 2 of 24
6. (grab-arm1 drone1 crate5 depot)
   deleted: (arm1-free drone1) (at crate5 depot)
   added: (arm1-load drone1 crate5)
   goals met: 2 of 24
7. (move-drone drone1 depot loc14)
   deleted: (at drone1 depot)
   added: (at drone1 loc14)
   goals met: 1 of 24
8. (deliver-arm2 drone1 person1 crate23 medicine loc14)
   deleted: (arm2-load drone1 crate23) (person-needs person1 medicine)
   added: (arm2-free drone1) (person-has person1 medicine)
   goals met: 2 of 24
9. (move-drone drone1 loc14 loc21)
   deleted: (at drone1 loc14)
   added: (at drone1 loc21)
   goals met: 2 of 24
10. (move-drone drone1 loc21 loc20)
   deleted: (at drone1 loc21)
   added: (at drone1 loc20)
   goals met: 2 of 24
11. (deliver-arm1 drone1 person2 crate5 food loc20)
   deleted: (arm1-load drone1 crate5) (person-needs person2 food)
   added: (arm1-free drone1) (person-has person2 food)
   goals met: 3 of 24
12. (move-drone drone1 loc20 depot)
   deleted: (at drone1 loc20)
   added: (at drone1 depot)
   goals met: 4 of 24
13. (grab-arm1 drone1 crate21 depot)
   deleted: (arm1-free drone1) (at crate21 depot)
   added: (arm1-load drone1 crate21)
   goals met: 4 of 24
14. (grab-arm2 drone1 crate15 depot)
   deleted: (arm2-free drone1) (at crate15 depot)
   added: (arm2-load drone1 crate15)
   goals met: 4 of 24
15. (move-drone drone1 depot loc15)
   deleted: (at drone1 depot)
   added: (at drone1 loc15)
   goals met: 3 of 24
16. (deliver-arm1 drone1 person3 crate21 food loc15)
   deleted: (arm1-load drone1 crate21) (person-needs person3 food)
   added: (arm1-free drone1) (person-has person3 food)
   goals met: 4 of 24
17. (move-drone drone1 loc15 loc14)
   deleted: (at drone1 loc15)
   added: (at drone1 loc14)
   goals met: 4 of 24
18. (deliver-arm2 drone1 person1 crate15 food loc14)
   deleted: (arm2-load drone1 crate15) (person-needs person1 food)
   added: (arm2-free drone1) (person-has person1 food)
   goals met: 5 of 24
19. (move-drone drone1 loc14 depot)
   deleted: (at drone1 loc14)
   added: (at drone1 depot)
   goals met: 6 of 24
20. (grab-arm2 drone1 crate12 depot)
   deleted: (arm2-free drone1) (at crate12 depot)
   added: (arm2-load drone1 crate12)
   goals met: 6 of 24
21. (grab-arm1 drone1 crate11 depot)
   deleted: (arm1-free drone1) (at crate11 depot)
   added: (arm1-load drone1 crate11)
   goals met: 6 of 24
22. (move-drone drone1 depot loc19)
   deleted: (at drone1 depot)
   added: (at drone1 loc19)
   goals met: 5 of 24
23. (deliver-arm2 drone1 person4 crate12 food loc19)
   deleted: (arm2-load drone1 crate12) (person-needs person4 food)
   added: (arm2-free drone1) (person-has person4 food)
   goals met: 6 of 24
24. (move-drone drone1 loc19 loc8)
   deleted: (at drone1 loc19)
   added: (at drone1 loc8)
   goals met: 6 of 24
25. (deliver-arm1 drone1 person5 crate11 food loc8)
   deleted: (arm1-load drone1 crate11) (person-needs person5 food)
   added: (arm1-free drone1) (person-has person5 food)
   goals met: 7 of 24
26. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 8 of 24
27. (grab-arm1 drone1 crate7 depot)
   deleted: (arm1-free drone1) (at crate7 depot)
   added: (arm1-load drone1 crate7)
   goals met: 8 of 24
28. (move-drone drone1 depot loc12)
   deleted: (at drone1 depot)
   added: (at drone1 loc12)
   goals met: 7 of 24
29. (deliver-arm1 drone1 person7 crate7 food loc12)
   deleted: (arm1-load drone1 crate7) (person-needs person7 food)
   added: (arm1-free drone1) (person-has person7 food)
   goals met: 8 of 24
30. (move-drone drone1 loc12 depot)
   deleted: (at drone1 loc12)
   added: (at drone1 depot)
   goals met: 9 of 24
31. (grab-arm1 drone1 crate2 depot)
   deleted: (arm1-free drone1) (at crate2 depot)
   added: (arm1-load drone1 crate2)
   goals met: 9 of 24
32. (grab-arm2 drone1 crate4 depot)
   deleted: (arm2-free drone1) (at crate4 depot)
   added: (arm2-load drone1 crate4)
   goals met: 9 of 24
33. (move-drone drone1 depot loc4)
   deleted: (at drone1 depot)
   added: (at drone1 loc4)
   goals met: 8 of 24
34. (deliver-arm1 drone1 person8 crate2 food loc4)
   deleted: (arm1-load drone1 crate2) (person-needs person8 food)
   added: (arm1-free drone1) (person-has person8 food)
   goals met: 9 of 24
35. (move-drone drone1 loc4 loc15)
   deleted: (at drone1 loc4)
   added: (at drone1 loc15)
   goals met: 9 of 24
36. (deliver-arm2 drone1 person9 crate4 food loc15)
   deleted: (arm2-load drone1 crate4) (person-needs person9 food)
   added: (arm2-free drone1) (person-has person9 food)
   goals met: 10 of 24
37. (move-drone drone1 loc15 depot)
   deleted: (at drone1 loc15)
   added: (at drone1 depot)
   goals met: 11 of 24
38. (grab-arm2 drone1 crate17 depot)
   deleted: (arm2-free drone1) (at crate17 depot)
   added: (arm2-load drone1 crate17)
   goals met: 11 of 24
39. (move-drone drone1 depot loc14)
   deleted: (at drone1 depot)
   added: (at drone1 loc14)
   goals met: 10 of 24
40. (deliver-arm2 drone1 person10 crate17 food loc14)
   deleted: (arm2-load drone1 crate17) (person-needs person10 food)
   added: (arm2-free drone1) (person-has person10 food)
   goals met: 11 of 24
41. (move-drone drone1 loc14 depot)
   deleted: (at drone1 loc14)
   added: (at drone1 depot)
   goals met: 12 of 24
42. (grab-arm2 drone1 crate1 depot)
   deleted: (arm2-free drone1) (at crate1 depot)
   added: (arm2-load drone1 crate1)
   goals met: 12 of 24
43. (grab-arm1 drone1 crate19 depot)
   deleted: (arm1-free drone1) (at crate19 depot)
   added: (arm1-load drone1 crate19)
   goals met: 12 of 24
44. (move-drone drone1 depot loc21)
   deleted: (at drone1 depot)
   added: (at drone1 loc21)
   goals met: 11 of 24
45. (deliver-arm2 drone1 person11 crate1 food loc21)
   deleted: (arm2-load drone1 crate1) (person-needs person11 food)
   added: (arm2-free drone1) (person-has person11 food)
   goals met: 12 of 24
46. (move-drone drone1 loc21 loc1)
   deleted: (at drone1 loc21)
   added: (at drone1 loc1)
   goals met: 12 of 24
47. (deliver-arm1 drone1 person12 crate19 food loc1)
   deleted: (arm1-load drone1 crate19) (person-needs person12 food)
   added: (arm1-free drone1) (person-has person12 food)
   goals met: 13 of 24
48. (move-drone drone1 loc1 depot)
   deleted: (at drone1 loc1)
   added: (at drone1 depot)
   goals met: 14 of 24
49. (grab-arm2 drone1 crate18 depot)
   deleted: (arm2-free drone1) (at crate18 depot)
   added: (arm2-load drone1 crate18)
   goals met: 14 of 24
50. (move-drone drone1 depot loc11)
   deleted: (at drone1 depot)
   added: (at drone1 loc11)
   goals met: 13 of 24
51. (deliver-arm2 drone1 person13 crate18 food loc11)
   deleted: (arm2-load drone1 crate18) (person-needs person13 food)
   added: (arm2-free drone1) (person-has person13 food)
   goals met: 14 of 24
52. (move-drone drone1 loc11 depot)
   deleted: (at drone1 loc11)
   added: (at drone1 depot)
   goals met: 15 of 24
53. (grab-arm2 drone1 crate9 depot)
   deleted: (arm2-free drone1) (at crate9 depot)
   added: (arm2-load drone1 crate9)
   goals met: 15 of 24
54. (move-drone drone1 depot loc19)
   deleted: (at drone1 depot)
   added: (at drone1 loc19)
   goals met: 14 of 24
55. (deliver-arm2 drone1 person14 crate9 food loc19)
   deleted: (arm2-load drone1 crate9) (person-needs person14 food)
   added: (arm2-free drone1) (person-has person14 food)
   goals met: 15 of 24
56. (move-drone drone1 loc19 depot)
   deleted: (at drone1 loc19)
   added: (at drone1 depot)
   goals met: 16 of 24
57. (grab-arm2 drone1 crate8 depot)
   deleted: (arm2-free drone1) (at crate8 depot)
   added: (arm2-load drone1 crate8)
   goals met: 16 of 24
58. (grab-arm1 drone1 crate16 depot)
   deleted: (arm1-free drone1) (at crate16 depot)
   added: (arm1-load drone1 crate16)
   goals met: 16 of 24
59. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 15 of 24
60. (deliver-arm1 drone1 person18 crate16 food loc5)
   deleted: (arm1-load drone1 crate16) (person-needs person18 food)
   added: (arm1-free drone1) (person-has person18 food)
   goals met: 16 of 24
61. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 17 of 24
62. (move-drone drone1 depot loc4)
   deleted: (at drone1 depot)
   added: (at drone1 loc4)
   goals met: 16 of 24
63. (deliver-arm2 drone1 person15 crate8 food loc4)
   deleted: (arm2-load drone1 crate8) (person-needs person15 food)
   added: (arm2-free drone1) (person-has person15 food)
   goals met: 17 of 24
64. (move-drone drone1 loc4 loc5)
   deleted: (at drone1 loc4)
   added: (at drone1 loc5)
   goals met: 17 of 24
65. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 18 of 24
66. (grab-arm2 drone1 crate6 depot)
   deleted: (arm2-free drone1) (at crate6 depot)
   added: (arm2-load drone1 crate6)
   goals met: 18 of 24
67. (move-drone drone1 depot loc2)
   deleted: (at drone1 depot)
   added: (at drone1 loc2)
   goals met: 17 of 24
68. (deliver-arm2 drone1 person16 crate6 food loc2)
   deleted: (arm2-load drone1 crate6) (person-needs person16 food)
   added: (arm2-free drone1) (person-has person16 food)
   goals met: 18 of 24
69. (move-drone drone1 loc2 depot)
   deleted: (at drone1 loc2)
   added: (at drone1 depot)
   goals met: 19 of 24
70. (grab-arm2 drone1 crate14 depot)
   deleted: (arm2-free drone1) (at crate14 depot)
   added: (arm2-load drone1 crate14)
   goals met: 19 of 24
71. (move-drone drone1 depot loc22)
   deleted: (at drone1 depot)
   added: (at drone1 loc22)
   goals met: 18 of 24
72. (deliver-arm2 drone1 person17 crate14 food loc22)
   deleted: (arm2-load drone1 crate14) (person-needs person17 food)
   added: (arm2-free drone1) (person-has person17 food)
   goals met: 19 of 24
73. (move-drone drone1 loc22 depot)
   deleted: (at drone1 loc22)
   added: (at drone1 depot)
   goals met: 20 of 24
74. (grab-arm2 drone1 crate20 depot)
   deleted: (arm2-free drone1) (at crate20 depot)
   added: (arm2-load drone1 crate20)
   goals met: 20 of 24
75. (move-drone drone1 depot loc15)
   deleted: (at drone1 depot)
   added: (at drone1 loc15)
   goals met: 19 of 24
76. (deliver-arm2 drone1 person19 crate20 food loc15)
   deleted: (arm2-load drone1 crate20) (person-needs person19 food)
   added: (arm2-free drone1) (person-has person19 food)
   goals met: 20 of 24
77. (move-drone drone1 loc15 depot)
   deleted: (at drone1 loc15)
   added: (at drone1 depot)
   goals met: 21 of 24
78. (grab-arm2 drone1 crate10 depot)
   deleted: (arm2-free drone1) (at crate10 depot)
   added: (arm2-load drone1 crate10)
   goals met: 21 of 24
79. (grab-arm1 drone1 crate13 depot)
   deleted: (arm1-free drone1) (at crate13 depot)
   added: (arm1-load drone1 crate13)
   goals met: 21 of 24
80. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 20 of 24
81. (deliver-arm2 drone1 person20 crate10 food loc8)
   deleted: (arm2-load drone1 crate10) (person-needs person20 food)
   added: (arm2-free drone1) (person-has person20 food)
   goals met: 21 of 24
82. (move-drone drone1 loc8 loc19)
   deleted: (at drone1 loc8)
   added: (at drone1 loc19)
   goals met: 21 of 24
83. (deliver-arm1 drone1 person21 crate13 food loc19)
   deleted: (arm1-load drone1 crate13) (person-needs person21 food)
   added: (arm1-free drone1) (person-has person21 food)
   goals met: 22 of 24
84. (move-drone drone1 loc19 depot)
   deleted: (at drone1 loc19)
   added: (at drone1 depot)
   goals met: 23 of 24
85. (grab-arm2 drone1 crate3 depot)
   deleted: (arm2-free drone1) (at crate3 depot)
   added: (arm2-load drone1 crate3)
   goals met: 23 of 24
86. (move-drone drone1 depot loc13)
   deleted: (at drone1 depot)
   added: (at drone1 loc13)
   goals met: 22 of 24
87. (deliver-arm2 drone1 person23 crate3 food loc13)
   deleted: (arm2-load drone1 crate3) (person-needs person23 food)
   added: (arm2-free drone1) (person-has person23 food)
   goals met: 23 of 24
88. (move-drone drone1 loc13 depot)
   deleted: (at drone1 loc13)
   added: (at drone1 depot)
   goals met: 24 of 24
